{
    "category_name": "protein_design",
    "tool_name": "rf_diffusion_motif_scaffolding",
    "tool_description": "Motif scaffolding involves creating novel amino acid sequences that will connect or scaffold specific segments within a predefined protein structure. The input typically includes the target PDB structure and the defined segments or loops to be scaffolded, and the output is a new protein structure predicted to achieve the desired scaffolded structure.",
    "required_parameters": [
        {
            "name": "contigs",
            "type": "PARAMETER",
            "description": "Defines the contiguous sequence segments for motif scaffolding, including segments to be connected or scaffolded within a defined protein structure. Example: '40/A163-181/40' for diffussing a scaffold with 40 amino acids on each side of the motif A163-181. Example: 'A3-30/36/A33-68' for diffusing a loop of length 36 between two segments (A3-30 and A33-68) of defined PDB ranges.",
            "example": "40/A163-181/40"
        },
        {
            "name": "protein_structure",
            "type": "STRUCTURE",
            "description": "The PDB (Protein Data Bank) identifier of the protein structure used for motif scaffolding. It guides the positioning of the sequence segments within the scaffold. Example: '5TPN'.",
            "example": "5TPN"
        }
    ],
    "optional_parameters": [
        {
            "name": "iterations",
            "type": "PARAMETER",
            "description": "Used to specify the number of iterations for the RF-diffusion.",
            "default": "50",
            "example": "50"
        },
        {
            "name": "hotspot",
            "type": "PARAMETER",
            "description": "Specifies any hotspot regions that should be prioritized during the backbone generation process.",
            "default": "",
            "example": ""
        },
        {
            "name": "visual",
            "type": "PARAMETER",
            "description": "The type of visualization output, which can be none, a static image, or an interactive display.",
            "default": "image",
            "example": "image"
        },
        {
            "name": "num_designs",
            "type": "PARAMETER",
            "description": "Used to specify the number of generated protein backbone designs.",
            "default": "1",
            "example": "1"
        },
        {
            "name": "symmetry",
            "type": "PARAMETER",
            "description": "Used to specify symmetry settings, such as automatic detection or cyclic symmetry.",
            "default": "none",
            "example": "none"
        },
        {
            "name": "order",
            "type": "PARAMETER",
            "description": "Used to specify the order of symmetry.",
            "default": "1",
            "example": "1"
        },
        {
            "name": "chains",
            "type": "SEQUENCE",
            "description": "Used to specify the protein chains to be processed.",
            "default": "A",
            "example": "A"
        },
        {
            "name": "partial_T",
            "type": "PARAMETER",
            "description": "Used to specify the number of noising steps in the partial diffusion protocol.",
            "default": "auto",
            "example": "auto"
        },
        {
            "name": "use_beta_model",
            "type": "PARAMETER",
            "description": "Used to select whether to use the Beta parameter model for better secondary structure element balance.",
            "default": "False",
            "example": "False"
        },
        {
            "name": "add_potential",
            "type": "PARAMETER",
            "description": "Used to specify the potential to be added to the RF-diffusion.",
            "default": "False",
            "example": "False"
        }
    ],
    "return_values": [
        {
            "name": "contigs",
            "type": "SEQUENCE",
            "description": "Contigs are segments of the protein backbone generated by RFdiffusion, representing specific sequences or portions of the protein's structure, crucial for understanding the formation of secondary and tertiary structures."
        }
    ]
}