{
    "category_name": "protein_design",
    "tool_name": "rf_diffusion_unconditional_protein_design",
    "tool_description": "Protein design involves creating novel amino acid sequences that will fold into desired three-dimensional structures with specific functions; the input typically includes desired structural properties or a predefined backbone structure, and the output is a new protein structure predicted to achieve these specified attributes.",
    "required_parameters": [
        {
            "name": "contigs",
            "type": "PARAMETER",
            "description": "Specifies the number of contiguous sequence segments to be generated during the diffusion process. Use a ':' to define multiple contigs. Example: '100' for a protein backbone of length 100. Example: '50:100' for a hetero-oligomer with two chains of length 50 and 100.",
            "example": "100"
        }
    ],
    "optional_parameters": [
        {
            "name": "iterations",
            "type": "PARAMETER",
            "description": "Used to specify the number of iterations for the RF-diffusion.",
            "default": "50",
            "example": "50"
        },
        {
            "name": "hotspot",
            "type": "PARAMETER",
            "description": "Specifies any hotspot regions that should be prioritized during the backbone generation process.",
            "default": "",
            "example": ""
        },
        {
            "name": "visual",
            "type": "PARAMETER",
            "description": "The type of visualization output, which can be none, a static image, or an interactive display.",
            "default": "image",
            "example": "image"
        },
        {
            "name": "num_designs",
            "type": "PARAMETER",
            "description": "Used to specify the number of generated protein backbone designs.",
            "default": "1",
            "example": "1"
        },
        {
            "name": "symmetry",
            "type": "PARAMETER",
            "description": "Used to specify symmetry settings, such as automatic detection or cyclic symmetry.",
            "default": "none",
            "example": "none"
        },
        {
            "name": "order",
            "type": "PARAMETER",
            "description": "Used to specify the order of symmetry.",
            "default": "1",
            "example": "1"
        },
        {
            "name": "chains",
            "type": "SEQUENCE",
            "description": "Used to specify the protein chains to be processed.",
            "default": "A",
            "example": "A"
        },
        {
            "name": "partial_T",
            "type": "PARAMETER",
            "description": "Used to specify the number of noising steps in the partial diffusion protocol.",
            "default": "auto",
            "example": "auto"
        },
        {
            "name": "use_beta_model",
            "type": "PARAMETER",
            "description": "Used to select whether to use the Beta parameter model for better secondary structure element balance.",
            "default": "False",
            "example": "False"
        },
        {
            "name": "add_potential",
            "type": "PARAMETER",
            "description": "Used to specify the potential to be added to the RF-diffusion.",
            "default": "False",
            "example": "False"
        }
    ],
    "return_values": [
        {
            "name": "contigs",
            "type": "SEQUENCE",
            "description": "Contigs are segments of the protein backbone generated by RFdiffusion, representing specific sequences or portions of the protein's structure, crucial for understanding the formation of secondary and tertiary structures."
        }
    ]
}